Revit 2027 API
ExternalEvent.Create Method
 Creates an instance of external event.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalEvent Create(
	IExternalEventHandler handler
)
Public Shared Function Create (
	handler As IExternalEventHandler
) As ExternalEvent
public:
static ExternalEvent^ Create(
	IExternalEventHandler^ handler
)
static member Create :
        handler : IExternalEventHandler -> ExternalEvent
Parameters
handler IExternalEventHandler
 An instance of IExternalEventHandler which will execute the event.
Return Value
ExternalEvent
 An instance of ExternalEvent class, which will be used to invoke the event
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
ExternalEvent Class
Autodesk.Revit.UI Namespace